function [p0,t0,pc,Eff_TriH,Dp0,Dpc,C1,C2,C3,Eff_TriM,Eff_TriL,Dprh,Dprhout,ps,Dps]=Known_graph_parameters
%******************************************************
%拟定热力过程线所需参数
%多缸汽轮机
% ****作者：王雷 zrqwl2003@126.com***
%******************************************************
%新蒸汽压力(MPa)：
p0=3.5;
%新蒸汽温度(℃)：
t0=435;
%凝汽器压力(MPa)：
pc=0.005;
%汽轮机高压缸的相对内效率(%):
Eff_TriH =0.8;
%高压缸主汽门节流压力损失(%)：
Dp0=0.05;
%排汽阻力损失(%)：
Dpc=0.000184;
%余速损失系数(%)：
C1=0.02;
%系数(kJ/kg)：
C2=9;
%冷再热压力与新蒸汽压力比例(%):
C3=0.21727;
%汽轮机中压缸的相对内效率(%):
Eff_TriM=0.93;
%汽轮机低压缸的相对内效率(%):
Eff_TriL=0.86;
%再热器压损(%):
Dprh=0.1;
%中压缸主汽门节流压力损失(%)：
Dprhout=0.02;
%中压缸排汽压力(%)：
ps=0.81;
%中低压缸连通管压力损失(%)：
Dps=0.02;