function [s_num,s_name,s_style,s_G,s_p0,s_t0,s_c0,s_dht,s_n,s_dm,s_omiga,s_e,s_alpha1,s_beta2,s_fai,s_miun,s_psai,s_miub,s_gdt,s_gdr,s_miu0,s_miu1]=Known_stage_parameters
%******************************************************
%级详细计算所需参数(50MW)
%计算个数s_num,级代号s_name(第几级），级类型s_style（冲动0，反动1），级流量s_G(kg/s)),级前压力s_p0(MPa),级前温度s_t0(℃)(或干度）,级前速度s_c0(m/s)
%级理想比焓降s_dht(kJ/kg),级转速s_n(r/min),级平均直径s_dm(mm),级平均反动度s_omiga,级部分进汽度s_e,级进汽角s_alpha1,级出汽角s_beta1
%级喷嘴速度系数s_fai,级喷嘴流量系数s_miun,级动叶速度系数s_psai,级动叶流量系数s_miub,叶顶盖度s_gdt(mm),叶根盖度s_gdr(mm)
%速度利用系数s_miu0,s_miu1
% ****作者：王雷 zrqwl2003@126.com***
%******************************************************
s_num=3;
s_name=[{'调节级'} {'第一压力级'} {'末级'}];
s_style=[0 1 1];
%根据书上P127-128的内容进行了修改
s_G=[48.13 46.98 32.63];
s_p0=[8.32 6.2141 0.0146];
s_t0=[533.13 493.96 0.975];
s_c0=[0 130.9 65.2];
s_dht=[110 51.23 162.92];
s_n=[3000 3000 3000];
s_dm=[1155 780 2549];
s_omiga=[0.08 0.479 0.466];
s_e=[0.89 1 1];
s_alpha1=[15.1 14.78 16.7];
s_beta2=[20.4 15.09 23.73];
s_fai=[0.97 0.97 0.97];
s_miun=[0.97 0.97 0.97];
s_psai=[0.925 0.9355 0.95];
s_miub=[0.964 0.964 0.964];
s_gdt=[1 1 2];
s_gdr=[1 1.5 3];
s_miu0=[0 0 1];
s_miu1=[0 1 0];
%？？？？