function [sstyle,G1,p01,h01,dhtc01,An,miun,fai,alpha1,beta1,beta2,Ab,miub,psai,miu1,db,ln,n]=Known_stage_sequence
%**************************************************************************
%级变工况顺序计算所需参数
%**************************************************************************
%级类型sstyle（冲动0，反动1）
%已知变工况后级前参数：蒸汽流量G1(kg/s)，压力p01(MPa),比焓h01(kJ/kg),上级余速dhtc01(kJ/kg)
%An喷嘴喉部面积(m^2),miun流量系数,fai喷嘴速度系数
%Ab动叶喉部面积(m^2),动叶速度系数psai，miub流量系数,
%miu1余速利用系数,db叶轮直径(m),ln喷嘴高度(mm),n转速
% ****作者：王雷 zrqwl2003@126.com***
%**************************************************************************
sstyle=[0 1 1];
G1=[56.56 43 32];
p01=[7.37 7 7];
h01=[3447.37 2100 980];
dhtc01=[0 0 0];
An=[0.00965 0 0];
miun=[0.97 0.97 0.97];
fai=[0.97 0.97 0.97];
alpha1=[10.75 13.4 14.5];
beta1=[22.15 17 20];
beta2=[17.89 20 20];
Ab=[0.01827 0.02 0.02];
miub=[0.964 0.96 0.98];
psai=[0.921 0.92 0.93];
% miu1=1;
% db=0.997;
% ln=16.5;
% n=3000;
% sstyle=0;
% G1=56.56;
% p01=7.37;
% h01=3447.37;
% dhtc01=0;
% An=0.00965;
% miun=0.97;
% fai=0.97;
% alpha1=10.75;
% beta1=22.15;
% beta2=17.89;
% Ab=0.01827;
% miub=0.964;
% psai=0.921;
% miu1=1;
% db=0.997;
% ln=16.5;
% n=3000;
% 
% 
